mermaid/sequence/asset_create.puml
@startuml
actor User as "一般使用者"
participant Frontend
participant Backend
participant Database

User ->> Frontend: 新增資產
Frontend ->> Backend: POST /api/isms/asset/
note over Backend, Frontend: 發送通知並等待核准允許流程完畢
Backend ->> Database: 新增資產資料
Backend ->> Frontend: 回傳並顯示至畫面
@enduml
